#+TITLE: Tests for ob-prolog


* Simple tests

  #+NAME: f
  #+BEGIN_SRC elisp
    '(1 2 3)
  #+END_SRC

  #+RESULTS: f
  | 1 | 2 | 3 |

  #+HEADER: :session *prolog-1*
  #+HEADER: :system swipl
  #+HEADER: :var a=f()
  #+HEADER: :var b="asdf"
  #+HEADER: :goal main(A, D)
  #+BEGIN_SRC prolog
    main(A, B) :- recorded(a, A), recorded(b, C), append([C], A, B).
  #+END_SRC

  #+RESULTS:
  : A = [1, 2, 3],
  : D = [asdf, 1, 2, 3].

  #+HEADER: :session *prolog-1*
  #+HEADER: :goal other(A)
  #+BEGIN_SRC prolog
    other(A) :- A is 3.
  #+END_SRC

  #+RESULTS:
  : A = 3.


  #+begin_src prolog
    :- format('Hello, ~a.', org_mode).
  #+end_src

  #+RESULTS:
  : Hello, org_mode.

  #+begin_src prolog :session *prolog-1*
    :- format('Hello, ~a.', org_session).
  #+end_src

  #+RESULTS:
  : Hello, org_session.
  : true.
